Revit 2027 API
StructuralSection.PrincipalAxesAngle Property
 Rotation angle between the principal axes and cross section reference planes.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PrincipalAxesAngle { get; set; }
Public Property PrincipalAxesAngle As Double
	Get
	Set
public:
property double PrincipalAxesAngle {
	double get ();
	void set (double value);
}
member PrincipalAxesAngle : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace